
dict = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень', 10: 'осень', 11: 'осень', 12: 'зима'}
m = int(input("Введите месяц в виде целого числа от 0 до 12: "))
print(dict.get(m))

list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
for el in list:
    m = int(input("Введите месяц в виде целого числа от 0 до 12: "))
    el = m
    if el == 1 or el ==2 or el == 12:
        print('зима')
    elif el >= 3 and el < 6:
        print('весна')
    elif el == 6 or el == 7 or el == 8:
        print('лето')
    elif el >= 9 and el < 12:
        print('осень')
    break

